app/controllers/lineitems_controller.rb

SELECT "lineitems".* FROM "lineitems"
---
  def index
    #render(:layout=>false)
    @lineitems = Lineitem.all

INSERT INTO "lineitems" ("service_name", "description", "payment_method", "delivery_date", "created_at", "updated_at", "service_features") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @lineitem = Lineitem.new(lineitem_params)

    respond_to do |format|
      if @lineitem.save

SELECT  "lineitems".* FROM "lineitems" WHERE "lineitems"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_lineitem
      @lineitem = Lineitem.find(params[:id])