app/controllers/orders_controller.rb

INSERT INTO "orders" ("order_number", "service_name", "product_price", "seller", "seller_website", "address", "payment_method", "description", "created_at", "updated_at", "service_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save