app/controllers/service_controller.rb

SELECT "services".* FROM "services"
---
	def index
		@services = Service.all

INSERT INTO "services" ("name", "features", "seller", "seller_website", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "test"], ["features", ""], ["seller", ""], ["seller_website", ""], ["description", ""], ["created_at", "2017-09-19 22:10:53.172492"], ["updated_at", "2017-09-19 22:10:53.172492"]]
---
	def create

		@service = Service.new(service_params)

	  if @service.save

UPDATE "services" SET "features" = ?, "price" = ?, "seller" = ?, "description" = ?, "updated_at" = ? WHERE "services"."id" = ?  [["features", ""], ["price", 30000], ["seller", "KORESOL "], ["description", ""], ["updated_at", "2017-09-24 19:12:20.503077"], ["id", 5]]
---
	def update
		if @service.update(service_params)

DELETE FROM "services" WHERE "services"."id" = ?  [["id", 1]]
---
	def destroy
    	@service.destroy

SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
		def set_order
		   @service = Service.find(params[:id])